In [90]:
import pandas as pd

In [91]:
df=pd.read_csv("./datasets/OP_DTL_GNRL_PGYR2017_P06302020.csv")

/Users/umangimistry/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (4,7,9,11,14,16,17,21,22,23,24,35,36,37,40,41,42,43,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [92]:
df.head()

,Change_Type,Covered_Recipient_Type,Teaching_Hospital_CCN,Teaching_Hospital_ID,Teaching_Hospital_Name,Physician_Profile_ID,Physician_First_Name,Physician_Middle_Name,Physician_Last_Name,Physician_Name_Suffix,...,Product_Category_or_Therapeutic_Area_4,Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_4,Associated_Drug_or_Biological_NDC_4,Covered_or_Noncovered_Indicator_5,Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_5,Product_Category_or_Therapeutic_Area_5,Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_5,Associated_Drug_or_Biological_NDC_5,Program_Year,Payment_Publication_Date
0,UNCHANGED,Covered Recipient Physician,NaN,NaN,NaN,1300911.0,MARION,NaN,ANTHONY,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,06/30/2020
1,UNCHANGED,Covered Recipient Physician,NaN,NaN,NaN,113198.0,ELISABETH,NaN,ANTON,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,06/30/2020
2,UNCHANGED,Covered Recipient Physician,NaN,NaN,NaN,924405.0,PETER,H,AHN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,06/30/2020
3,UNCHANGED,Covered Recipient Physician,NaN,NaN,NaN,924405.0,PETER,H,AHN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,06/30/2020
4,UNCHANGED,Covered Recipient Physician,NaN,NaN,NaN,780716.0,DAVID,B,MANSUR,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,06/30/2020

From all columns I am just concern about the Name, City, State and their total amount of payment in 2017.

In [93]:
df=df[['Physician_First_Name','Physician_Last_Name', 'Recipient_City', 
                                             'Recipient_State', 
                                             'Total_Amount_of_Payment_USDollars']]

In [94]:
df.shape

(11395407, 5)

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11395407 entries, 0 to 11395406
Data columns (total 5 columns):
 #   Column                             Dtype
---  ------                             -----
 0   Physician_First_Name               object
 1   Physician_Last_Name                object
 2   Recipient_City                     object
 3   Recipient_State                    object
 4   Total_Amount_of_Payment_USDollars  float64
dtypes: float64(1), object(4)
memory usage: 434.7+ MB

In [98]:
# to make it easy and for joining with other dataset I changed the column name

df=df.rename(columns={'Physician_First_Name':'first_name', 'Physician_Last_Name':'last_name','Recipient_City':'city','Recipient_State':'state','Total_Amount_of_Payment_USDollars':'Total_Payment_Sum'})

In [99]:
df.head()

  first_name last_name          city state  Total_Payment_Sum
0     MARION   ANTHONY    PLEASANTON    CA              14.32
1  ELISABETH     ANTON      BELLEVUE    WA              10.61
2      PETER       AHN  PHILADELPHIA    PA              80.32
3      PETER       AHN  PHILADELPHIA    PA             100.00
4      DAVID    MANSUR     CLEVELAND    OH              31.50

Cleaning up the rows to make is similar with other datasets

In [100]:
# Removing the punctuation from the first name

df["first_name"]=df["first_name"].str.replace('[^\w\s]','')

In [101]:
# Making the first name upper case

df["first_name"]=df["first_name"].str.upper()

In [102]:
# Making the last name upper case

df["last_name"]=df["last_name"].str.upper()

In [103]:
df["first_name"].nunique()

54506

In [104]:
df["last_name"].nunique()

174529

In [105]:
df["Name"]=df["first_name"]+" "+df["last_name"]

In [106]:
df=df.drop(columns=["first_name","last_name"])

In [107]:
df=df[['Name','city', 'state', 'Total_Payment_Sum']]

In [108]:
df.head()

              Name          city state  Total_Payment_Sum
0   MARION ANTHONY    PLEASANTON    CA              14.32
1  ELISABETH ANTON      BELLEVUE    WA              10.61
2        PETER AHN  PHILADELPHIA    PA              80.32
3        PETER AHN  PHILADELPHIA    PA             100.00
4     DAVID MANSUR     CLEVELAND    OH              31.50

In [110]:
df["Name"].nunique()

546478

In [113]:
df=df.groupby("Name")["Total_Payment_Sum"].sum().reset_index()

In [114]:
df

                       Name  Total_Payment_Sum
0             01SOHEIR AZER              12.64
1                   A AKBAR             366.07
2                  A ALBALA          112622.87
3                  A ALICEA             362.77
4                 A AMINIAN            4690.72
...                     ...                ...
546473  ZYGMUNT ORZECHOWSKI              19.34
546474     ZYLKIA RODRIGUEZ             238.55
546475      ZYNIA PUA-VINES             104.33
546476         ZYNNIA ZAFRA             923.82
546477        ZYRA O'CONNOR              95.19

[546478 rows x 2 columns]

In [48]:
df["Total_Payment_Sum"].describe()

count    6.729210e+05
mean     3.233258e+03
std      6.843778e+04
min      3.000000e-02
25%      4.054000e+01
50%      1.381700e+02
75%      5.320000e+02
max      2.684353e+07
Name: Total_Payment_Sum, dtype: float64

In [115]:
df.shape

(546478, 2)

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 546478 entries, 0 to 546477
Data columns (total 2 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Name               546478 non-null  object
 1   Total_Payment_Sum  546478 non-null  float64
dtypes: float64(1), object(1)
memory usage: 8.3+ MB

In [122]:
df.to_csv("./datasets/payment.csv")